Tekla.Structures.Model.Reinforcement
The Reinforcement class represents a reinforcement in the model. A reinforcement can either be a mesh,
a single rebar, a rebar group or a strand.

Tekla.Structures.Model.Reinforcement.MAX_ON_PLANE_OFFSET_VALUES
Maximum on plane offset values.

Tekla.Structures.Model.Reinforcement.MAX_REBAR_RADIUS_VALUES
Maximum rebar radius values.

Tekla.Structures.Model.Reinforcement.MAX_REBAR_SPACING_VALUES
Maximum rebar splicing values.

Tekla.Structures.Model.Reinforcement.MAX_REBAR_GROUP_SPACING_VALUES
Maximum rebar group spacing values.

Tekla.Structures.Model.Reinforcement.MAX_REBAR_POLYGONS
Maximum rebar polygons.

Tekla.Structures.Model.Reinforcement.Father
Gets or sets the father object of the reinforcement; the model object instance to operate on.

Tekla.Structures.Model.Reinforcement.Grade
Gets or sets the steel grade of the reinforcing bar.
The grade indicates the strength of the steel used in reinforcing bars.
It can also indicate other factors, such as the weldability or surface deformations of the bar.

Tekla.Structures.Model.Reinforcement.Name
Gets or sets the name of the reinforcement.

Tekla.Structures.Model.Reinforcement.Class
Gets or sets the class of the reinforcement. The class is used to group reinforcements.

Tekla.Structures.Model.Reinforcement.NumberingSeries
Gets or sets the numbering series of the reinforcement.

Tekla.Structures.Model.Reinforcement.OnPlaneOffsets
Gets or sets the double offset value for each leg on the same plane as the bar.

Tekla.Structures.Model.Reinforcement.FromPlaneOffset
Gets or sets the offset value from the part surface.

Tekla.Structures.Model.Reinforcement.StartPointOffsetType
Gets or sets the type of the start point offset is either OFFSET_TYPE_LEG_LENGTH or OFFSET_TYPE_COVER_THICKNESS.

Tekla.Structures.Model.Reinforcement.StartPointOffsetValue
Gets or sets the concrete cover thickness or leg length at the first end of the bar.

Tekla.Structures.Model.Reinforcement.EndPointOffsetType
Gets or sets the type of the end point offset. The options are:
OFFSET_TYPE_LEG_LENGTH
OFFSET_TYPE_COVER_THICKNESS

Tekla.Structures.Model.Reinforcement.EndPointOffsetValue
Gets or sets the concrete cover thickness or leg length at the second end of the bar.

Tekla.Structures.Model.Reinforcement.RadiusValues
Gets or sets the radius value(s) of the bends in the bar.

Tekla.Structures.Model.Reinforcement.InputPointDeformingState
Gets or sets the reinforcement input point deforming state.

Tekla.Structures.Model.Reinforcement._Size
Gets or sets the size of the bar.

Tekla.Structures.Model.Reinforcement._wires
Stores the physical rebars from which the RebarMesh consists of.
The rebars may be requested one at a time or all in a list, and they contain
physical points that single rebar has. These points can both include the hook
points or not depending on how the retreiving function is called.

Tekla.Structures.Model.Reinforcement.#ctor
Initializes a new instance of the Reinforcement class with empty attributes.

Tekla.Structures.Model.Reinforcement.GetRebarGeometries(Tekla.Structures.Model.Reinforcement.RebarGeometryOptionEnum)
Retrieves a list of physical reinforcing bars (of type RebarGeometry).
These objects contain physical points in the 3D space of each reinforcing bar.
options: The options.
Returns: An array list that contains the RebarGeometry objects.

Tekla.Structures.Model.Reinforcement.GetRebarGeometries(System.Boolean)
Retrieves a list of physical reinforcing bars (of type RebarGeometry).
These objects contain physical points in the 3D space of each reinforcing bar.
withHooks: A parameter to determine whether the hook points should be included in the rebar geometry or not.
Returns: An array list that contains the RebarGeometry objects.

Tekla.Structures.Model.Reinforcement.GetRebarGeometriesWithoutClashes(System.Boolean)
Retrieves a list of physical reinforcing bars (of type RebarGeometry).
These objects contain physical points in the 3D space of each reinforcing bar as shown in model view.
In case rebar polygon clashes with itself, physical points are moved to avoid clashing.
withHooks: A parameter to determine whether the hook points should be included in the rebar geometry or not.
Returns: An array list that contains the RebarGeometry objects.

Tekla.Structures.Model.Reinforcement.GetRebarComplexGeometries(System.Boolean,System.Boolean,System.Boolean)
Retrieves a list of physical reinforcing bars (of type Tekla.Structures.Model.RebarComplexGeometry).
These objects contain physical curves in the 3D space of each reinforcing bar as shown in model view.
Tekla.Structures.Model.RebarComplexGeometry only differs from Tekla.Structures.Model.RebarGeometry by containing a polycurve rather than a polyline.
withHooks: A parameter to determine whether the hook points should be included in the rebar geometry or not.
withoutClashes: A parameter to determine whether self-clash avoidance should be included in the rebar geometry or not.
lengthAdjustments: A parameter to determine whether rounding and step tapering should be included in the rebar geometry or not.
Returns: A list of Tekla.Structures.Model.RebarComplexGeometrys.
Deprecated since TS2023, please use GetRebarComplexGeometries with simplified parameter instead.

Tekla.Structures.Model.Reinforcement.GetRebarComplexGeometries(System.Boolean,System.Boolean,System.Boolean,Tekla.Structures.Model.Reinforcement.RebarGeometrySimplificationTypeEnum)
Retrieves a list of physical reinforcing bars (of type Tekla.Structures.Model.RebarComplexGeometry).
These objects contain physical curves in the 3D space of each reinforcing bar as shown in model view.
Tekla.Structures.Model.RebarComplexGeometry only differs from Tekla.Structures.Model.RebarGeometry by containing
a polycurve (of Tekla.Structures.Geometry3d.Arc and Tekla.Structures.Geometry3d.LineSegment objects) rather than a polyline.
The polycurve only contains arcs if the "simplified" parameter is RATIONALIZED or FABRICATION.
If "simplified" is NONE, any arcs will be returned as a series of line segments.
withHooks: A parameter to determine whether the hook points should be included in the rebar geometry or not.
withoutClashes: A parameter to determine whether self-clash avoidance should be included in the rebar geometry or not.
lengthAdjustments: A parameter to determine whether rounding and step tapering should be included in the rebar geometry or not.
simplified: A parameter to determine whether the "simplified" rebar shape recognition geometry should be returned.
Returns: A list of Tekla.Structures.Model.RebarComplexGeometrys.

Tekla.Structures.Model.Reinforcement.IsGeometryValid
Tells whether the geometry of a reinforcement object is valid or not.
Returns: True if the geometry of the reinforcement is valid, false otherwise.

Tekla.Structures.Model.Reinforcement.GetNumberOfRebars
Returns the number of rebars in the reinforcing group.
Returns: The number of rebars in the rebar group.

Tekla.Structures.Model.Reinforcement.GetSingleRebar(System.Int32,System.Boolean)
Returns a single rebar inside the rebar group located by the given index.
The indexing starts from the start point. The rebar represents a physical reinforcing bar
and contains physical points in the 3D space of the bar.
The method returns null on error, for example if given an erroneous index.
The number of rebars in the group can be requested with GetNumberOfRebars().
index: The index of the rebar in the group.
withHooks: A parameter to determine whether the hook points should be included in the rebar geometry or not.
Returns: The instance of a RebarGeometry object that contains the point list of the single physical reinforcing bar. Null if the given index was not valid.

Tekla.Structures.Model.Reinforcement.GetSingleRebarWithoutClash(System.Int32,System.Boolean)
Returns a single rebar inside the rebar group located by the given index.
The indexing starts from the start point. The rebar represents a physical reinforcing bar
and contains physical, non-clashing points in the 3D space of the bar.
The method returns null on error, for example if given an erroneous index.
The number of rebars in the group can be requested with GetNumberOfRebars().
index: The index of the rebar in the group.
withHooks: A parameter to determine whether the hook points should be included in the rebar geometry or not.
Returns: The instance of a RebarGeometry object that contains the point list of the single physical reinforcing bar. Null if the given index was not valid.

Tekla.Structures.Model.Reinforcement.GetSolid
Method for getting the solid information of the reinforcement.
Returns: The solid instance of the reinforcement.

Tekla.Structures.Model.Reinforcement.GetFatherPour
Returns the pour that the rebar is associated to.
Returns: The pour object.
Deprecated since TS v2018.

Tekla.Structures.Model.Reinforcement.GetFatherPourUnit
Returns the pour unit that the rebar is associated to.
Returns: A pour unit.

Tekla.Structures.Model.Reinforcement.GetAssembly
Returns the assembly that the reinforcement belongs to.
Returns: The assembly that the reinforcement belongs to.

Tekla.Structures.Model.Reinforcement.SelectInnerRebars(System.Boolean,System.Boolean,System.Boolean)
Selects the physical rebars inside the group.
These rebars contain for example physical points of the rebar.
The function fetches all physical rebars for the structure. Due to remoting limitations,
they may be fetched with several subsequent remote calls when handling a big reinforcement structure.
This may cause some overhead.
The function is only called once, when first inquiry about the physical rebarsis made.
withHooks: Parameter to determine whether the hook points should be included or not.
withoutClashes: Parameter to determine whether the polygon points should be moved to avoid clashing or not.
lengthAdjustments: Parameter to determine whether the bar should have round and step tapering applied.

Tekla.Structures.Model.Reinforcement.GetComplexGeometries(System.Boolean,System.Boolean,System.Boolean,Tekla.Structures.Model.Reinforcement.RebarGeometrySimplificationTypeEnum)
Gets the "complex" geometries of the bars.
withHooks: A parameter to determine whether the hook points should be included in the rebar geometry or not.
withoutClashes: A parameter to determine whether self-clash avoidance should be included in the rebar geometry or not.
lengthAdjustments: A parameter to determine whether rounding and step tapering should be included in the rebar geometry or not.
simplified: A parameter to determine whether the "simplified" rebar shape recognition geometry should be returned.
Returns: A list of Tekla.Structures.Model.RebarComplexGeometry objects.

Tekla.Structures.Model.Reinforcement.ToStruct(Tekla.Structures.ModelInternal.dotReinforcement_t@)
Method for transforming the Reinforcement data into corresponding struct.
p: Reference to the struct which will be populated.

Tekla.Structures.Model.Reinforcement.FromStruct(Tekla.Structures.ModelInternal.dotReinforcement_t@)
Method for transforming the struct data to corresponding Reinforcement data.
p: Reference to the struct which will be used to populate the Reinforcement data.